# create Pandas Series

In [2]:
import pandas as pd

In [3]:
a = pd.Series([56,78,8,10,3.94])

In [4]:
a

0    56.00
1    78.00
2     8.00
3    10.00
4     3.94
dtype: float64

In [5]:
type(a)

pandas.core.series.Series

In [6]:
a

0    56.00
1    78.00
2     8.00
3    10.00
4     3.94
dtype: float64

In [7]:
a[3]

10.0

In [8]:
a[2:4]

2     8.0
3    10.0
dtype: float64

In [9]:
a = pd.Series(['soc','python','Java'])

In [10]:
a

0       soc
1    python
2      Java
dtype: object

In [14]:
a = pd.date_range(start = '12-1-2019', end = '12-31-2019')

In [15]:
a

DatetimeIndex(['2019-12-01', '2019-12-02', '2019-12-03', '2019-12-04',
               '2019-12-05', '2019-12-06', '2019-12-07', '2019-12-08',
               '2019-12-09', '2019-12-10', '2019-12-11', '2019-12-12',
               '2019-12-13', '2019-12-14', '2019-12-15', '2019-12-16',
               '2019-12-17', '2019-12-18', '2019-12-19', '2019-12-20',
               '2019-12-21', '2019-12-22', '2019-12-23', '2019-12-24',
               '2019-12-25', '2019-12-26', '2019-12-27', '2019-12-28',
               '2019-12-29', '2019-12-30', '2019-12-31'],
              dtype='datetime64[ns]', freq='D')

In [16]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# Pandas dataframe

In [17]:
import numpy as np

In [18]:
temp = np.random.randint(low = 20, high =100, size = [10,])
name = np.random.choice(['nabin','vamsi','parth','satish'],size=10)
random = np.random.choice([10,11,13,12,14],10)

In [19]:
random

array([11, 10, 14, 13, 11, 13, 13, 11, 12, 13])

In [20]:
name

array(['parth', 'nabin', 'parth', 'parth', 'nabin', 'vamsi', 'vamsi',
       'parth', 'nabin', 'satish'], dtype='|S6')

In [21]:
temp

array([33, 40, 71, 58, 43, 80, 55, 59, 61, 85])

In [22]:
a = list(zip(temp, name, random))

In [23]:
a

[(33, 'parth', 11),
 (40, 'nabin', 10),
 (71, 'parth', 14),
 (58, 'parth', 13),
 (43, 'nabin', 11),
 (80, 'vamsi', 13),
 (55, 'vamsi', 13),
 (59, 'parth', 11),
 (61, 'nabin', 12),
 (85, 'satish', 13)]

In [24]:
df = pd.DataFrame(data = a, columns=['temp','name','random'])

In [25]:
df

   temp    name  random
0    33   parth      11
1    40   nabin      10
2    71   parth      14
3    58   parth      13
4    43   nabin      11
5    80   vamsi      13
6    55   vamsi      13
7    59   parth      11
8    61   nabin      12
9    85  satish      13

In [26]:
type(df)

pandas.core.frame.DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
temp = np.random.randint(low = 20, high =100, size = [10,])
name = np.random.choice(['nabin','vamsi','parth','satish'],size=10)
random = np.random.choice([10,11,13,12,14],10)

In [3]:
df = pd.DataFrame({'temp':temp, 'name':name, 'random':random})

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df

     name  random  temp
0   parth      11    60
1   nabin      14    38
2   vamsi      12    84
3  satish      13    20
4   vamsi      14    59
5   nabin      13    48
6   nabin      11    79
7  satish      10    32
8   parth      13    41
9   nabin      14    73

In [6]:
df.head(2)

    name  random  temp
0  parth      11    60
1  nabin      14    38

In [7]:
df.tail(3)

     name  random  temp
7  satish      10    32
8   parth      13    41
9   nabin      14    73

In [8]:
df.shape

(10, 3)

In [9]:
df.columns

Index([u'name', u'random', u'temp'], dtype='object')

In [10]:
df.values

array([['parth', 11, 60],
       ['nabin', 14, 38],
       ['vamsi', 12, 84],
       ['satish', 13, 20],
       ['vamsi', 14, 59],
       ['nabin', 13, 48],
       ['nabin', 11, 79],
       ['satish', 10, 32],
       ['parth', 13, 41],
       ['nabin', 14, 73]], dtype=object)

In [11]:
# normal indexing is not support 
# it can support only slicing and dicing 
df[2:7]

     name  random  temp
2   vamsi      12    84
3  satish      13    20
4   vamsi      14    59
5   nabin      13    48
6   nabin      11    79

In [12]:
df[2:9:3]

    name  random  temp
2  vamsi      12    84
5  nabin      13    48
8  parth      13    41

In [13]:
# access whole column data
df['random']

0    11
1    14
2    12
3    13
4    14
5    13
6    11
7    10
8    13
9    14
Name: random, dtype: int32

In [14]:
df.name

0     parth
1     nabin
2     vamsi
3    satish
4     vamsi
5     nabin
6     nabin
7    satish
8     parth
9     nabin
Name: name, dtype: object

In [15]:
df['name']

0     parth
1     nabin
2     vamsi
3    satish
4     vamsi
5     nabin
6     nabin
7    satish
8     parth
9     nabin
Name: name, dtype: object

In [16]:
df.describe()

          random       temp
count  10.000000  10.000000
mean   12.500000  53.400000
std     1.433721  21.198532
min    10.000000  20.000000
25%    11.250000  38.750000
50%    13.000000  53.500000
75%    13.750000  69.750000
max    14.000000  84.000000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
name      10 non-null object
random    10 non-null int32
temp      10 non-null int32
dtypes: int32(2), object(1)
memory usage: 232.0+ bytes

In [18]:
df

     name  random  temp
0   parth      11    60
1   nabin      14    38
2   vamsi      12    84
3  satish      13    20
4   vamsi      14    59
5   nabin      13    48
6   nabin      11    79
7  satish      10    32
8   parth      13    41
9   nabin      14    73

In [19]:
df.set_index('name', inplace = False)

        random  temp
name
parth       11    60
nabin       14    38
vamsi       12    84
satish      13    20
vamsi       14    59
nabin       13    48
nabin       11    79
satish      10    32
parth       13    41
nabin       14    73

In [20]:
df

     name  random  temp
0   parth      11    60
1   nabin      14    38
2   vamsi      12    84
3  satish      13    20
4   vamsi      14    59
5   nabin      13    48
6   nabin      11    79
7  satish      10    32
8   parth      13    41
9   nabin      14    73

In [21]:
df.set_index('name',inplace=True)

In [22]:
df

        random  temp
name
parth       11    60
nabin       14    38
vamsi       12    84
satish      13    20
vamsi       14    59
nabin       13    48
nabin       11    79
satish      10    32
parth       13    41
nabin       14    73

In [23]:
df.sort_index(axis =0, ascending=True)

        random  temp
name
nabin       14    38
nabin       13    48
nabin       11    79
nabin       14    73
parth       11    60
parth       13    41
satish      13    20
satish      10    32
vamsi       12    84
vamsi       14    59

In [25]:
df

        random  temp
name
parth       11    60
nabin       14    38
vamsi       12    84
satish      13    20
vamsi       14    59
nabin       13    48
nabin       11    79
satish      10    32
parth       13    41
nabin       14    73

In [26]:
df.sort_values(by ='random', ascending = True,inplace =True)

In [27]:
df

        random  temp
name
satish      10    32
parth       11    60
nabin       11    79
vamsi       12    84
satish      13    20
nabin       13    48
parth       13    41
nabin       14    38
vamsi       14    59
nabin       14    73

In [28]:
df.drop(['random'], axis =1)

        temp
name
satish    32
parth     60
nabin     79
vamsi     84
satish    20
nabin     48
parth     41
nabin     38
vamsi     59
nabin     73

In [29]:
df

        random  temp
name
satish      10    32
parth       11    60
nabin       11    79
vamsi       12    84
satish      13    20
nabin       13    48
parth       13    41
nabin       14    38
vamsi       14    59
nabin       14    73

In [30]:
df.iloc[[1,2]]

       random  temp
name
parth      11    60
nabin      11    79

In [31]:
df.iloc[:,1]

name
satish    32
parth     60
nabin     79
vamsi     84
satish    20
nabin     48
parth     41
nabin     38
vamsi     59
nabin     73
Name: temp, dtype: int32

In [32]:
df.iloc[[True,True,False,True]]

        random  temp
name
satish      10    32
parth       11    60
vamsi       12    84

In [33]:
df.loc[[True,True,True,True]]

        random  temp
name
satish      10    32
parth       11    60
nabin       11    79
vamsi       12    84

In [34]:
df.set_index('random',inplace=False)

        temp
random
10        32
11        60
11        79
12        84
13        20
13        48
13        41
14        38
14        59
14        73

In [35]:
df

        random  temp
name
satish      10    32
parth       11    60
nabin       11    79
vamsi       12    84
satish      13    20
nabin       13    48
parth       13    41
nabin       14    38
vamsi       14    59
nabin       14    73

In [37]:
df.loc['nabin']

       random  temp
name
nabin      11    79
nabin      13    48
nabin      14    38
nabin      14    73

In [38]:
df.loc['nabin','temp']

name
nabin    79
nabin    48
nabin    38
nabin    73
Name: temp, dtype: int32

In [39]:
df.loc[['nabin','satish']]

        random  temp
name
nabin       11    79
nabin       13    48
nabin       14    38
nabin       14    73
satish      10    32
satish      13    20

In [43]:
df.loc['nabin']

       random  temp
name
nabin      11    79
nabin      13    48
nabin      14    38
nabin      14    73

In [44]:
df.loc[df.temp > 50]

       random  temp
name
parth      11    60
nabin      11    79
vamsi      12    84
vamsi      14    59
nabin      14    73

In [45]:
df.loc[(df.temp <80) | (df.temp == 91),:]

        random  temp
name
satish      10    32
parth       11    60
nabin       11    79
satish      13    20
nabin       13    48
parth       13    41
nabin       14    38
vamsi       14    59
nabin       14    73

In [46]:
import pandas as pd
import warnings 
warnings.filterwarnings('ignore')

In [47]:
# Merging & concat
d1 = pd.DataFrame([['a', 1], ['b', 2]],columns=['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']],columns=['letter', 'number', 'animal'])

In [48]:
d1

  col1  number
0    a       1
1    b       2

In [49]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [76]:
pd.concat([d1,d2],axis =0)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [50]:
pd.concat([d1,d2], axis =0, ignore_index=True)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
2   lion  NaN      c       3
3  tiger  NaN      d       4

In [51]:
pd.concat([d1,d2], axis = 1)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger

In [52]:
d1 = pd.DataFrame({
    "city" : ["lucknow","kanpur","agra","delhi"],
    "temperature" : [32,45,30,40]
})

In [53]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [54]:
d2 = pd.DataFrame({
    "city" : ["delhi","lucknow","kanpur"],
    "humidity" : [68,65,75]
})

In [87]:
d2

      city  humidity
0    delhi        68
1  lucknow        65
2   kanpur        75

In [55]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [56]:
df = pd.merge(d1,d2, on='city')

In [57]:
df

      city  temperature  humidity
0  lucknow           32        65
1   kanpur           45        75
2    delhi           40        68

In [58]:
pd.merge(d1,d2, on=['city'], how ='outer')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [59]:
pd.merge(d1, d2, on =['city'], how='left')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [73]:
# dataset from https://github.com/codebasics/py/blob/master/pandas/6_handling_missing_data_replace/weather_data.csv

In [60]:
import pandas as pd
df1 = pd.read_csv("weather_data.csv")

In [61]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [62]:
# pip3 install openpyxl
df1.to_excel('df_xl.xlsx', sheet_name = 'weather_data')

In [63]:
# pip3 install xlrd
df2 = pd.read_excel('df_xl.xlsx')

In [64]:
df2

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [65]:
df2.to_csv('file.csv')

In [66]:
df2.to_csv('file_noindex.csv', index = False)

In [67]:
df_group = df2.groupby("event")

In [68]:
df_group

In [69]:
for temperature in df_group:
    print(temperature)

(u'Rain',    Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain)
(u'Snow',    Unnamed: 0       day  temperature  windspeed event
2           2  1/3/2017           28          2  Snow
3           3  1/4/2017           24          7  Snow)
(u'Sunny',    Unnamed: 0       day  temperature  windspeed  event
1           1  1/2/2017           35          7  Sunny
5           5  1/6/2017           31          2  Sunny)

In [70]:
df_group.get_group('Rain')

   Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain

In [71]:
df_group.describe()

      Unnamed: 0                                           temperature        \
           count mean       std  min   25%  50%   75%  max       count  mean
event
Rain         2.0  2.0  2.828427  0.0  1.00  2.0  3.00  4.0         2.0  32.0
Snow         2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0         2.0  26.0
Sunny        2.0  3.0  2.828427  1.0  2.00  3.0  4.00  5.0         2.0  33.0

       ...             windspeed
       ...   75%   max     count mean       std  min   25%  50%   75%  max
event  ...
Rain   ...  32.0  32.0       2.0  5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   ...  27.0  28.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  ...  34.0  35.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

[3 rows x 24 columns]

In [72]:
def hot_temp(x):
    return x > 30

In [73]:
df2['hot_temp'] = df2['temperature'].apply(hot_temp)

In [74]:
df2

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

In [75]:
df2['hot_temp'] = df2['temperature'].apply(lambda x: x > 30)

In [76]:
df2

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

In [92]:
#pivot table

In [77]:
df2.pivot_table(values = 'temperature', index = 'event', aggfunc = 'mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [97]:
df2.pivot_table(columns = 'temperature')

temperature  24  28  31  32  35
Unnamed: 0    3   2   5   2   1
windspeed     7   2   2   5   7

In [96]:
help(pd.DataFrame.pivot_table)

Help on function pivot_table in module pandas.core.frame:

pivot_table(self, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All')
    Create a spreadsheet-style pivot table as a DataFrame. The levels in
    the pivot table will be stored in MultiIndex objects (hierarchical
    indexes) on the index and columns of the result DataFrame

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function or list of functions, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
    fill_value : scalar, default None
        Value to replace missing values with
    margins : boolean, default False
        Add all row / columns (e.g. for subtotal / grand totals)
    dropna : boolean, default True
        Do not include columns whose entries are all NaN
    margins_name : string, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
    >>> df
         A    B      C  D
    0  foo  one  small  1
    1  foo  one  large  2
    2  foo  one  large  2
    3  foo  two  small  3
    4  foo  two  small  3
    5  bar  one  large  4
    6  bar  one  small  5
    7  bar  two  small  6
    8  bar  two  large  7

    >>> table = pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    ... # doctest: +NORMALIZE_WHITESPACE
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    Returns
    -------
    table : DataFrame

    See also
    --------
    DataFrame.pivot : pivot without aggregation that can handle
        non-numeric data